modm-ext/data.modm.io/docs/svd/header_stm32wba64xx.svd
        <register>
          <name>SMPR</name>
          <description>ADC sampling time register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SMP1</name>
              <description>ADC group of channels sampling time 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP2</name>
              <description>ADC group of channels sampling time 2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMPSEL0</name>
              <description>ADC channel 0 sampling time selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMPSEL1</name>
              <description>ADC channel 1 sampling time selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMPSEL2</name>
              <description>ADC channel 2 sampling time selection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMPSEL3</name>
              <description>ADC channel 3 sampling time selection</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMPSEL4</name>
              <description>ADC channel 4 sampling time selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMPSEL5</name>
              <description>ADC channel 5 sampling time selection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMPSEL6</name>
              <description>ADC channel 6 sampling time selection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMPSEL7</name>
              <description>ADC channel 7 sampling time selection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMPSEL8</name>
              <description>ADC channel 8 sampling time selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMPSEL9</name>
              <description>ADC channel 9 sampling time selection</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMPSEL10</name>
              <description>ADC channel 10 sampling time selection</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMPSEL11</name>
              <description>ADC channel 11 sampling time selection</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMPSEL12</name>
              <description>ADC channel 12 sampling time selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMPSEL13</name>
              <description>ADC channel 13 sampling time selection</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMPSEL14</name>
              <description>ADC channel 14 sampling time selection</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMPSEL15</name>
              <description>ADC channel 15 sampling time selection</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMPSEL16</name>
              <description>ADC channel 16 sampling time selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMPSEL17</name>
              <description>ADC channel 17 sampling time selection</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD1TR</name>
          <description>ADC analog watchdog 1 threshold register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LT1</name>
              <description>ADC analog watchdog 1 threshold low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>HT1</name>
              <description>ADC Analog watchdog 1 threshold high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD2TR</name>
          <description>ADC watchdog threshold register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LT2</name>
              <description>ADC analog watchdog 2 threshold low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>HT2</name>
              <description>ADC analog watchdog 2 threshold high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHSELR</name>
          <description>ADC channel select register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHSEL0</name>
              <description>ADC group regular sequencer channel 0, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL1</name>
              <description>ADC group regular sequencer channel 1, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL2</name>
              <description>ADC group regular sequencer channel 2, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL3</name>
              <description>ADC group regular sequencer channel 3, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL4</name>
              <description>ADC group regular sequencer channel 4, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL5</name>
              <description>ADC group regular sequencer channel 5, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL6</name>
              <description>ADC group regular sequencer channel 6, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL7</name>
              <description>ADC group regular sequencer channel 7, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL8</name>
              <description>ADC group regular sequencer channel 8, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL9</name>
              <description>ADC group regular sequencer channel 9, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL10</name>
              <description>ADC group regular sequencer channel 10, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL11</name>
              <description>ADC group regular sequencer channel 11, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL12</name>
              <description>ADC group regular sequencer channel 12, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL13</name>
              <description>ADC group regular sequencer channel 13, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL14</name>
              <description>ADC group regular sequencer channel 14, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL15</name>
              <description>ADC group regular sequencer channel 15, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL16</name>
              <description>ADC group regular sequencer channel 16, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL17</name>
              <description>ADC group regular sequencer channel 17, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SQ6</name>
              <description>ADC group regular sequencer rank 6, available when ADC_CFGR1_CHSELRMOD is set</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SQ7</name>
              <description>ADC group regular sequencer rank 7, available when ADC_CFGR1_CHSELRMOD is set</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SQ8</name>
              <description>ADC group regular sequencer rank 8, available when ADC_CFGR1_CHSELRMOD is set</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHSELR_ALT</name>
          <description>ADC channel select register</description>
          <alternateRegister>CHSELR</alternateRegister>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SQ1</name>
              <description>ADC group regular sequencer rank 1, available when ADC_CFGR1_CHSELRMOD is set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SQ2</name>
              <description>ADC group regular sequencer rank 2, available when ADC_CFGR1_CHSELRMOD is set</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SQ3</name>
              <description>ADC group regular sequencer rank 3, available when ADC_CFGR1_CHSELRMOD is set</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SQ4</name>
              <description>ADC group regular sequencer rank 4, available when ADC_CFGR1_CHSELRMOD is set</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SQ5</name>
              <description>ADC group regular sequencer rank 5, available when ADC_CFGR1_CHSELRMOD is set</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SQ6</name>
              <description>ADC group regular sequencer rank 6, available when ADC_CFGR1_CHSELRMOD is set</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SQ7</name>
              <description>ADC group regular sequencer rank 7, available when ADC_CFGR1_CHSELRMOD is set</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SQ8</name>
              <description>ADC group regular sequencer rank 8, available when ADC_CFGR1_CHSELRMOD is set</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD3TR</name>
          <description>ADC watchdog threshold register</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LT3</name>
              <description>ADC analog watchdog 3 threshold low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>HT3</name>
              <description>ADC analog watchdog 3 threshold high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>ADC group regular data register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>ADC group regular conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRR</name>
          <description>ADC power register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AUTOFF</name>
              <description>ADC auto-off mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>ADC low power mode auto power-off disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPD</name>
              <description>ADC deep power down mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>ADC deep power down in autonomous mode disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>ADC deep power down in autonomous mode enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD2CR</name>
          <description>ADC analog watchdog 2 configuration register</description>
          <addressOffset>0xa0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AWD2CH</name>
              <description>ADC analog watchdog 2 monitored channel selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD3CR</name>
          <description>ADC analog watchdog 3 configuration register</description>
          <addressOffset>0xa4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AWD3CH</name>
              <description>ADC analog watchdog 3 monitored channel selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CALFACT</name>
          <description>ADC Calibration factor register</description>
          <addressOffset>0xc4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CALFACT</name>
              <description>ADC calibration factor in single-ended mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <description>ADC common configuration register</description>
          <addressOffset>0x308</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRESC</name>
              <description>ADC common clock prescaler</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV6</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV10</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV12</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV128</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV256</name>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREFEN</name>
              <description>ADC internal path to VrefInt enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSEN</name>
              <description>ADC internal path to temperature sensor enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
